code-review/NRB_3471_3546/База_Было/DataProcessors/ЗагрузкаНеторговыхПоручений_Новая.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаНеторговыхПоручений_Новая</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникЗагрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиЗагрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьСводныеПоручения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСУДК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеДляПоручений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Загружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПоручения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодДО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДОтправитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодДП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИсполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РСДОтправительКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РСДОтправитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РCДПолучательКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РCДПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетРазделДЕПО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетПриемник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УидПользователя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЦБ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Биржа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеОтказа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДеятельности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЦБ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД_Брокера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CP</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DepoCP</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепоКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SubDepoCP</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепоКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поручение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PayDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DealDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Инициатор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Референс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DepoCPClient</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ClientName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ISIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SecRegNumber</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСоздания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Place</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеМестаРасчетов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МХКонтрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>KafkaMessageId</Name>
							<Comment>MessageId сообщения Кафки, если источником загрузки поручения выступает Панда. Не путать с ИдентификаторЗагрузки - в нем хранится Идентификатор консолидированного поручения из Панда (ConsolidatedNumber).</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DepoMessageId</Name>
							<Comment>Идентификатор сообщения Kafka в РС ЖурналВходящихСообщенийKafka (не совпадает с KafkaMessageId)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ИсточникиЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ИсточникиЗагрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>QUIK</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Панда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СУДК</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/DataProcessors/ЗагрузкаНеторговыхПоручений_Новая/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.НачалоПериода	= НачалоГода(ТекущаяДата());
	Объект.КонецПериода		= КонецДня(ТекущаяДата());
	Если Параметры.Свойство("ИмяОбработкиQUIK") Тогда
		ИмяОбработкиQUIK = Параметры.ИмяОбработкиQUIK;
	КонецЕсли;
	Объект.ИсточникЗагрузки = Перечисления.ИсточникиЗагрузки.Панда;
	Объект.ФормироватьСводныеПоручения = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИсточникЗагрузкиПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТабличнойЧасти

&НаКлиенте
Процедура ДанныеДляПорученийЗагружатьПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДанныеДляПоручений.ТекущиеДанные;
	ТабЧасть = Объект.ДанныеДляПоручений;
	ТекЗагружать = ТекущиеДанные.Загружать;
	ТекИДБрокера = ТекущиеДанные.ИД_Брокера;
	Для Каждого СтрокаТЧ Из ТабЧасть Цикл
		Если ЗначениеЗаполнено(ТекИДБрокера) И СтрокаТЧ.ИД_Брокера = ТекИДБрокера Тогда
			СтрокаТЧ.Загружать = ТекЗагружать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьДанные(Команда)
	ПолучитьДанныНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ПометкаВыделить(Команда)
	Для Каждого Строка ИЗ Объект.ДанныеДляПоручений Цикл
		Строка.Загружать	= Истина;		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПометкаСнять(Команда)
	Для Каждого Строка ИЗ Объект.ДанныеДляПоручений Цикл
		Строка.Загружать	= Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПометкаИнвертировать(Команда)
	Для Каждого Строка ИЗ Объект.ДанныеДляПоручений Цикл
		Строка.Загружать	= Не Строка.Загружать;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	Если Объект.ФормироватьСводныеПоручения И Не ВыбраныВсеСтрокиСОдинаковымИДБрокера() Тогда
		Ответ = Вопрос("Выделены не все строки с совпадающим ИД брокера. Продолжить создание поручений?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Проверка найден ли поставщик в "поручениях" по операциям "депонирования"
	Для Каждого Данные Из Объект.ДанныеДляПоручений Цикл
		Если Не Данные.Загружать Или Не ЭтоОперацияДепонирования(Данные.ВидОперации) Или Не ЗначениеЗаполнено(Данные.ID) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Данные.DepoCP) И Не ЗначениеЗаполнено(Данные.СчетДепоКонтрагента) Тогда
			Данные.СчетДепоКонтрагента = СчетДепоПоКоду(Данные.ID, Данные.DepoCP, Данные.DepoCPClient);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Данные.СчетДепоКонтрагента) И ЗначениеЗаполнено(Данные.SubDepoCP)
			И Не ЗначениеЗаполнено(Данные.РазделСчетаДепоКонтрагента) Тогда
			Данные.РазделСчетаДепоКонтрагента = РазделСчетаДепоПоКоду(Данные.SubDepoCP, Данные.СчетДепоКонтрагента);
			Если Данные.НаименованиеМестаРасчетов = "Депозитарий БКП" Тогда
				Данные.МХКонтрагент = МХКонтрагентаПоРазделу(Данные.РазделСчетаДепоКонтрагента);
			КонецЕсли;
		КонецЕсли;
		
		ТребуетсяСозданиеДанныхКонтрагента = ЗначениеЗаполнено(Данные.DepoCP) И Не ЗначениеЗаполнено(Данные.СчетДепоКонтрагента)
		Или ЗначениеЗаполнено(Данные.SubDepoCP) И Не ЗначениеЗаполнено(Данные.РазделСчетаДепоКонтрагента);
		
		Если ТребуетсяСозданиеДанныхКонтрагента Тогда
			Ответ	= Вопрос("Найдены не все реквизиты 'Поставщика' ("+Данные.CP+") в 'Поручении' №"
							+Данные.НомерПоручения+" с типом операции 'Депонирование'!
							|
							|Создать недостающие объекты?", РежимДиалогаВопрос.ДаНет);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				СоздатьНедостающегоПоставщикаСервер(Данные.НомерПоручения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СоздатьДокументыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЖурналВходящихСообщенийKafka(Команда)
	ВнешнийИсточник = ПредопределенноеЗначение("ПланВидовХарактеристик.ВнешниеИсточники.KafkaPandaConsNti1634");
	ЗначениеОтбора = Новый Структура("ВнешнийИсточник", ВнешнийИсточник);
	ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("РегистрСведений.ЖурналВходящихСообщенийKafka.ФормаСписка", ПараметрыВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЖурналИсходящихСообщенийKafka(Команда)
	ВнешнийИсточник = ПредопределенноеЗначение("ПланВидовХарактеристик.ВнешниеИсточники.KafkaDepoToPandaNotification1642");
	ЗначениеОтбора = Новый Структура("ВнешнийИсточник", ВнешнийИсточник);
	ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("РегистрСведений.ЖурналИсходящихСообщенийKafka.ФормаСписка", ПараметрыВыбора);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьДанныНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Если ЗначениеЗаполнено(ИмяОбработкиQUIK) Тогда
		ОбработкаОбъект.ИнициироватьСоединение(Новый Структура("ИмяОбработки", ИмяОбработкиQUIK));
	КонецЕсли;
	ОбработкаОбъект.ПолучитьТаблицуПорученийЗаПериод(Объект.НачалоПериода, Объект.КонецПериода);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура СоздатьНедостающегоПоставщикаСервер(НомерПоручения)
	Если Не ЗначениеЗаполнено(НомерПоручения) Тогда
		Возврат;
	КонецЕсли;
	ПараметрыПоиска = Новый Структура("НомерПоручения", НомерПоручения);
	СтрокиСПоручением = Объект.ДанныеДляПоручений.НайтиСтроки(ПараметрыПоиска);
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Для Каждого Строка Из СтрокиСПоручением Цикл
		ОбработкаОбъект.СоздатьНедостающегоПоставщика(Строка);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ЗагрузитьНеторговыеПоручения();	
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоОперацияДепонирования(ВидОперации)
		
	Возврат (ВидОперации = Справочники.ВидыОпераций.Депонирование ИЛИ ВидОперации = Справочники.ВидыОпераций.СнятиеСДепонирования);
	
КонецФункции

&НаСервере
Функция ВыбраныВсеСтрокиСОдинаковымИДБрокера()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДляПоручений.Загружать КАК Загружать,
	|	ДанныеДляПоручений.ИД_Брокера КАК ИД_Брокера,
	|	ДанныеДляПоручений.Поручение КАК Поручение
	|ПОМЕСТИТЬ ДанныеДляПоручений
	|ИЗ
	|	&ДанныеДляПоручений КАК ДанныеДляПоручений
	|ГДЕ
	|	ДанныеДляПоручений.Поручение = ЗНАЧЕНИЕ(Документ.Поручение.ПустаяСсылка)
	|	И ДанныеДляПоручений.ИД_Брокера <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляПоручений.ИД_Брокера КАК ИД_Брокера
	|ИЗ
	|	ДанныеДляПоручений КАК ДанныеДляПоручений
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляПоручений.ИД_Брокера
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ДанныеДляПоручений.Загружать) <> МАКСИМУМ(ДанныеДляПоручений.Загружать)";
	
	Запрос.УстановитьПараметр("ДанныеДляПоручений", Объект.ДанныеДляПоручений.Выгрузить(, "Загружать, ИД_Брокера, Поручение"));
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Выборка.ИД_Брокера);
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

&НаСервере
Функция СчетДепоПоКоду(КодКонтрагента, КодСчетаДепо, КодСчетаДепоКлиентаКонтрагента)
	Если Не ЗначениеЗаполнено(КодКонтрагента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Контрагент = Справочники.Контрагенты.НайтиПоКоду(КодКонтрагента);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Если ЗначениеЗаполнено(КодСчетаДепоКлиентаКонтрагента) Тогда
		КодСчетаДляПоиска = ОбработкаОбъект.КодСчетаДепоПоКодуСчетаКлиентаКонтрагента(КодСчетаДепоКлиентаКонтрагента, КодСчетаДепо);
		СчетДепоКонтрагента = Справочники.СчетаДепо.НайтиПоКоду(КодСчетаДляПоиска, , , Контрагент);
	Иначе
		СчетДепоКонтрагента = ОбработкаОбъект.ПодобратьСчетДепо(Контрагент, КодСчетаДепо);
	КонецЕсли;
	
	Возврат СчетДепоКонтрагента;
КонецФункции

&НаСервереБезКонтекста
Функция РазделСчетаДепоПоКоду(КодРаздела, ВладелецРаздела)
	
	Возврат Справочники.РазделыСчетаДепо.НайтиПоКоду(КодРаздела,,, ВладелецРаздела);
	
КонецФункции

&НаСервере
Функция МХКонтрагентаПоРазделу(РазделСчетаДепоКонтрагента)
	Если Не ЗначениеЗаполнено(РазделСчетаДепоКонтрагента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.МХКонтрагентаПоРазделу(РазделСчетаДепоКонтрагента);
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	ЭтоЗагрузкаИзПанда = (Объект.ИсточникЗагрузки = ПредопределенноеЗначение("Перечисление.ИсточникиЗагрузки.Панда"));
	Элементы.Контрагент.Видимость = ЭтоЗагрузкаИзПанда;
КонецПроцедуры

#КонецОбласти
